# Core
brew "git"
brew "stow"
brew "curl"
brew "wget"
brew "gh"

# Build tools
brew "cmake"
brew "pkg-config"
brew "llvm"

# Shell
brew "sheldon"
brew "starship"
brew "zsh"

# Terminal
cask "kitty"

# Fonts
cask "font-hack-nerd-font"

# Multiplexer
brew "tmux"

# Editor
brew "neovim"

# Modern CLI (Rust tools)
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "lazygit"
brew "fzf"
brew "zoxide"

# Dev tools
brew "mise"
brew "go"
brew "uv"
brew "direnv"

# Utilities
brew "jq"
brew "yq"
brew "htop"
brew "btop"
brew "fastfetch"
brew "ansible"
